## Import libraries

In [7]:
%pylab inline
import pandas as pd
import seaborn as sns 

from datetime import datetime

Populating the interactive namespace from numpy and matplotlib

## Uploading data

In [46]:
df_movies = pd.read_csv(r'C:\Users\DELL\Desktop\Data\movies.csv')

In [18]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [19]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34208 entries, 0 to 34207
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  34208 non-null  int64
 1   title    34208 non-null  object
 2   genres   34208 non-null  object
dtypes: int64(1), object(2)
memory usage: 801.9+ KB

In [20]:
df_movies.shape

(34208, 3)

In [23]:
df_links = pd.read_csv(r'C:\Users\DELL\Desktop\Data\links.csv')

In [24]:
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [25]:
df_links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34208 entries, 0 to 34207
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  34208 non-null  int64
 1   imdbId   34208 non-null  int64
 2   tmdbId   33912 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 801.9 KB

In [62]:
df_ratings = pd.read_csv(r'C:\Users\DELL\Desktop\Data\ratings.csv')

In [27]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [28]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22884377 entries, 0 to 22884376
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 698.4 MB

In [29]:
df_tags = pd.read_csv(r'C:\Users\DELL\Desktop\Data\tags.csv')

In [30]:
del df_tags
del df_links

## Data cleaning

In [47]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [48]:
df_movies['movieId'].dtype

dtype('int64')

In [49]:
df_movies['movieId'].isna().sum()

0

In [50]:
_df = df_movies['title'].str.split(r'(\(\d\d\d\d\))', expand=True)\
    .drop(columns=2) \
    .rename(columns={0: 'title',1:'year'})
df_movies['title'] = _df['title']
df_movies['year'] = _df['year'].str.strip('()')
del _df
df_movies.head()

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995

In [51]:
df_movies['year'].dtype

dtype('O')

In [53]:
df_movies['year'] = df_movies['year'].fillna(-1).astype(np.int16)
df_movies['year'].dtype

dtype('int16')

In [55]:
df_movies['genres'] = df_movies['genres'].replace({'no genres listed': ''})\
    .str.lower()\
    .str.split('|')\
    .apply(lambda x: frozenset(x))
df_movies

,movieId,title,genres,year
0,1,Toy Story,"(children, animation, comedy, adventure, fantasy)",1995
1,2,Jumanji,"(children, fantasy, adventure)",1995
2,3,Grumpier Old Men,"(comedy, romance)",1995
3,4,Waiting to Exhale,"(drama, comedy, romance)",1995
4,5,Father of the Bride Part II,(comedy),1995
...,...,...,...,...
34203,151697,Grand Slam,(thriller),1967
34204,151701,Bloodmoney,((no genres listed)),2010
34205,151703,The Butterfly Circus,(drama),2009
34206,151709,Zero,"(drama, sci-fi)",2015
34207,151711,The 2000 Year Old Man,((no genres listed)),1975

In [59]:
df_movies.to_pickle(r'C:\Users\DELL\Desktop\Data\movies-clean.pkl')

In [68]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [70]:
del df_ratings['userId']

In [71]:
df_ratings.head()

   movieId  rating   timestamp
0      169     2.5  1204927694
1     2471     3.0  1204927438
2    48516     5.0  1204927435
3     2571     3.5  1436165433
4   109487     4.0  1436165496

In [72]:
df_ratings['movieId'].dtype

dtype('int64')

In [73]:
df_ratings['timestamp']=pd.to_datetime(df_ratings['timestamp'], unit='s')

In [74]:
df_ratings

          movieId  rating           timestamp
0             169     2.5 2008-03-07 22:08:14
1            2471     3.0 2008-03-07 22:03:58
2           48516     5.0 2008-03-07 22:03:55
3            2571     3.5 2015-07-06 06:50:33
4          109487     4.0 2015-07-06 06:51:36
...           ...     ...                 ...
22884372    49530     5.0 2015-04-30 23:52:42
22884373    69481     3.0 2015-04-30 23:53:04
22884374    74458     4.0 2015-04-30 23:52:48
22884375    76093     5.0 2015-04-30 23:50:11
22884376   130636     0.5 2015-04-30 23:48:41

[22884377 rows x 3 columns]

In [75]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22884377 entries, 0 to 22884376
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   movieId    int64
 1   rating     float64
 2   timestamp  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 523.8 MB

In [76]:
df_ratings['rating'].max()

5.0

In [77]:
df_ratings['rating'].min()

0.5

In [78]:
df_ratings['rating'] = df_ratings['rating'].astype(np.float16)

In [79]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22884377 entries, 0 to 22884376
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   movieId    int64
 1   rating     float16
 2   timestamp  datetime64[ns]
dtypes: datetime64[ns](1), float16(1), int64(1)
memory usage: 392.8 MB

In [80]:
df_ratings.to_pickle(r'C:\Users\DELL\Desktop\Data\ratings-clean.pkl')